FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ns_РеквизитыНоменклатурыДляШаблона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_РеквизитыНоменклатурыДляШаблона</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокПолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ns_ШаблоныОбъявлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_ШаблоныОбъявлений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийТекстОбъявлений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокАдресов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Префикс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СмещениеВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПубликации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>Номенклатура</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, создавший запись о номенклатуре</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата создания записи о номенклатуре</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИностранное</Name>
					<Comment>Иностранное наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Comment>Тип номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Comment>Вид номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Comment>Вид платежа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>Базовая единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЕдиницаИзмерения</Name>
					<Comment>Основная единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестомости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияДопРасходов</Name>
					<Comment>Заполняется только для услуг и управляет распределением суммы по услуге в пределах документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределенияДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДопРасходов</Name>
					<Comment>Заполняется для услуг. По этой статье происходит начисление расходов / доходов при поставке / отгрузке</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>Страна происхождения по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХраненияТовара</Name>
					<Comment>(в днях) из конфигурации Торговый Комплекс</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Comment>Процент наценки по умолчанию (для расчета цен)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаАвтокаталога</Name>
					<Comment>Индекс картинки номенклатуры в автокаталоге</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНДСПоРеализации</Name>
					<Comment>Счет учета НДС по реализации используется при выгрузке в бухгалтерию</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Регламентированный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьПоставок</Name>
					<Comment>Количество, которое можем заказывать у поставщика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятаСПроизводства</Name>
					<Comment>Номенклатура снята с производства</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретПродажи</Name>
					<Comment>Запрет продажи номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретЗакупки</Name>
					<Comment>Запрет закупки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>Обычно соответствует массе Брутто в основной единице измерения массы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>Соотвестует объему в основной единице измерения объема</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Артикул для поиска</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прослеживаемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SafetyStock</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ИсключитьОтслеживаниеНепродТов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
					<Comment>Состав набора</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЯчейкиХраненияУдалить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкладКомпании</Name>
							<Comment>Склад компании</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаХранения</Name>
							<Comment>Ячейка хранения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/ns_ШаблонизаторСервер/Ext/Module.bsl
Функция ПолучитьРеквизиты() Экспорт
	
	Реквизиты = Новый ТаблицаЗначений;
	Реквизиты.Колонки.Добавить("Наименование");
	
	ДобавитьРеквизит(Реквизиты, "Наименование");		
	ДобавитьРеквизит(Реквизиты, "Описание");		
	ДобавитьРеквизит(Реквизиты, "Артикул");		
	ДобавитьРеквизит(Реквизиты, "Характеристика");		
	ДобавитьРеквизит(Реквизиты, "ОстатокКоличество");		
	ДобавитьРеквизит(Реквизиты, "ОстатокМногоМало5");		
	ДобавитьРеквизит(Реквизиты, "ОстатокМногоМало10");		
	ДобавитьРеквизит(Реквизиты, "ОстатокМногоМало20");		
	
	Возврат Реквизиты; 
КонецФункции

Функция ПолучитьРеквизитыНоменклатуры() Экспорт
	
	Реквизиты = Новый ТаблицаЗначений;
	Реквизиты.Колонки.Добавить("Наименование");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_РеквизитыНоменклатурыДляШаблонаСписокПолей.ИмяПоля КАК ИмяПоля
	|ИЗ
	|	Справочник.ns_РеквизитыНоменклатурыДляШаблона.СписокПолей КАК ns_РеквизитыНоменклатурыДляШаблонаСписокПолей";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Реквизиты;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьРеквизит(Реквизиты, Выборка.ИмяПоля);	
	КонецЦикла; 
	
	Возврат Реквизиты; 
КонецФункции

Процедура ДобавитьРеквизит(Таблица, Значение)
	НовСтр = Таблица.Добавить();
	НовСтр.Наименование = Значение;
КонецПроцедуры

Функция ПолучитьЗначениеРеквизита(Номенклатура, ДопРеквизит, Таблица) Экспорт
	
	ДанныеВозврата = Неопределено;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Объект", Номенклатура);
	Отбор.Вставить("СвойствоНаименование", ДопРеквизит);
	Строки = Таблица.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		ДанныеВозврата = Строки[0].Значение;	
	КонецЕсли; 
	
	Возврат ДанныеВозврата;
КонецФункции

Функция СформироватьTitle(ШаблонЗаголовка, Заголовок, Номенклатура, Характеристика) Экспорт
	Наименование = ns_Переопределяемый.ПолучитьНаименованиеНоменклатуры(Номенклатура);
	
	Если ЗначениеЗаполнено(Характеристика) И ns_ОбщегоНазначенияПовтИсп.ПолучитьПодставлятьХарактеристикуВЗаголовок() Тогда
		Наименование = Лев(Наименование + " " + Строка(Характеристика), 50);
	Иначе
		Наименование = Лев(Наименование, 50);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ШаблонЗаголовка) Тогда
		Возврат ВычислитьРегулярноеВыражение(ШаблонЗаголовка, Наименование, Характеристика);
	КонецЕсли; 
	
	ОбщийШаблонЗаголовка = ns_ОбщегоНазначенияПовтИсп.ПолучитьШаблонЗаголовка();
	Если ЗначениеЗаполнено(ОбщийШаблонЗаголовка) Тогда
		Возврат ВычислитьРегулярноеВыражение(ОбщийШаблонЗаголовка, Наименование, Характеристика);
	КонецЕсли; 
	
	Возврат Наименование;
КонецФункции

Функция ВычислитьРегулярноеВыражение(Шаблон, Наименование, Характеристика) Экспорт
	Результат = Наименование;
	
	Попытка
		RegExp = Новый COMОбъект("VBScript.RegExp");
		Если RegExp = Неопределено Тогда
			Возврат Результат;	
		КонецЕсли; 
		
		RegExp.IgnoreCase = Ложь;
		RegExp.Global = Истина;
		RegExp.MultiLine = Истина;
		
		RegExp.Pattern = Шаблон.РегулярноеВыражение;
		Если Шаблон.Replace И ЗначениеЗаполнено(Шаблон.ПодстрокаДляЗамены) Тогда
			РезультатРазбора = RegExp.Replace(Наименование, Шаблон.ПодстрокаДляЗамены);
		Иначе	
			РезультатРазбора = RegExp.Execute(Наименование);
		КонецЕсли; 
		
		Если ТипЗнч(РезультатРазбора) = Тип("Строка") Тогда
			Возврат РезультатРазбора;
		КонецЕсли; 
		
		Если РезультатРазбора.Count > 0 Тогда
			Для каждого ТекущийОбъект Из РезультатРазбора Цикл
				Если ТекущийОбъект.SubMatches.Count > 0 Тогда
					Для каждого Строка Из ТекущийОбъект.SubMatches Цикл
						Результат = Строка;	
					КонецЦикла; 
				КонецЕсли; 	
			КонецЦикла; 
		КонецЕсли; 
	Исключение
		ns_ОбщегоНазначения.СообщениеПользователю(ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки; 
	
	Возврат Результат;
КонецФункции

Функция СформироватьСтруктуруШаблона(Данные)
	СтруктуруШаблона = Новый Структура;
	СтруктуруШаблона.Вставить("ОбщийТекстОбъявлений", Данные.ОбщийТекстОбъявлений);
	СтруктуруШаблона.Вставить("Телефон", Данные.Телефон);
	СтруктуруШаблона.Вставить("Менеджер", Данные.Менеджер);
	СтруктуруШаблона.Вставить("Магазин", Данные.Магазин);
	СтруктуруШаблона.Вставить("Адрес", Данные.Адрес);
	Возврат СтруктуруШаблона;
КонецФункции
 
Функция ПолучитьСписокШаблонов()
	
	ДанныеШаблонизатора = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ШаблоныОбъявлений.Ссылка КАК Ссылка,
	|	ns_ШаблоныОбъявлений.ОбщийТекстОбъявлений КАК ОбщийТекстОбъявлений,
	|	ns_ШаблоныОбъявлений.Телефон КАК Телефон,
	|	ns_ШаблоныОбъявлений.Менеджер КАК Менеджер,
	|	ns_ШаблоныОбъявлений.Магазин КАК Магазин,
	|	ns_ШаблоныОбъявлений.Адрес КАК Адрес
	|ИЗ
	|	Справочник.ns_ШаблоныОбъявлений КАК ns_ШаблоныОбъявлений
	|ГДЕ
	|	ns_ШаблоныОбъявлений.ПометкаУдаления = ЛОЖЬ";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ДанныеШаблонизатора;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеШаблонизатора.Вставить(Выборка.Ссылка, СформироватьСтруктуруШаблона(Выборка));
	КонецЦикла; 
	
	Возврат ДанныеШаблонизатора;
КонецФункции

Функция ПолучитьДанныеДляШаблонизатора(Остатки, Номенклатура) Экспорт
	
	ДанныеДляШаблонизатора = Новый Структура;
	ДанныеДляШаблонизатора.Вставить("ДопРеквизиты", ns_Переопределяемый.ПолучитьЗначенияДополнительныхРеквизитов(Номенклатура));
	ДанныеДляШаблонизатора.Вставить("ИменаДопРеквизитов", СформироватьИменаДопРеквизитовПоШаблонам());
	ДанныеДляШаблонизатора.Вставить("Остатки", Остатки);
	ДанныеДляШаблонизатора.Вставить("РеквизитыНоменклатуры", СформироватьДанныеНоменклатуры(Номенклатура));
	ДанныеДляШаблонизатора.Вставить("Характеристики", ns_Переопределяемый.ПолучитьЗначенияХарактеристикДляШаблона(Номенклатура));

	Возврат ДанныеДляШаблонизатора;
КонецФункции

Функция ПолучитьЗначениеДопРеквизита(Номенклатура, ДопРеквизит, Таблица) Экспорт
	
	ДанныеВозврата = Неопределено;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Объект", Номенклатура);
	Отбор.Вставить("СвойствоНаименование", ДопРеквизит);
	Строки = Таблица.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		ДанныеВозврата = Строки[0].Значение;	
	КонецЕсли; 
	
	Возврат ДанныеВозврата;
КонецФункции

Функция СформироватьИменаДопРеквизитовПоШаблонам()
	
	ИменаДопРеквизитовКонфигурации = Новый СписокЗначений;
	ИменаДопРеквизитовПоШаблонам = Новый Соответствие;

	ns_Переопределяемый.ЗаполнитьДопРеквизиты(ИменаДопРеквизитовКонфигурации);
	СписокШаблонов = ПолучитьСписокШаблонов();
	
	Для каждого Шаблон Из СписокШаблонов Цикл
		ОбщийТекстОбъявлений = Шаблон.Значение.ОбщийТекстОбъявлений;
		СписокИменШаблона = Новый СписокЗначений;
		Для каждого Строка Из ИменаДопРеквизитовКонфигурации Цикл
			Если Найти(ОбщийТекстОбъявлений, "[" + Строка.Значение +"]") > 0 Тогда
				СписокИменШаблона.Добавить(Строка.Значение);
			КонецЕсли; 
		КонецЦикла;
		ИменаДопРеквизитовПоШаблонам.Вставить(Шаблон.Ключ, СписокИменШаблона);
	КонецЦикла;
	
	Возврат ИменаДопРеквизитовПоШаблонам;
КонецФункции

Процедура ЗаполнитьДанныеИзШаблона(ДанныеОбъявления, Шаблон, Магазин, ДанныеДляШаблонизатора, Адрес) Экспорт
	
	Если ЗначениеЗаполнено(Шаблон.Телефон) Тогда
		ДанныеОбъявления.ContactPhone = Шаблон.Телефон; 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Адрес) Тогда
		ДанныеОбъявления.Address = Адрес; 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Шаблон.Менеджер) Тогда
		ДанныеОбъявления.ManagerName = Шаблон.Менеджер; 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Шаблон.ОбщийТекстОбъявлений) Тогда
		ОбщийТекстОбъявлений = ЗаменитьВШаблоне(Шаблон, ДанныеОбъявления, ДанныеДляШаблонизатора);
		ДанныеОбъявления.ТекстОбъявления = "<![CDATA[" + Лев(СокрЛП(ОбщийТекстОбъявлений), 4980) + "]]>";
	КонецЕсли; 
	
КонецПроцедуры

Функция ЗаменитьВШаблоне(Шаблон, Данные, ДанныеДляШаблонизатора)
	
	ОбщийТекстОбъявлений = Шаблон.ОбщийТекстОбъявлений;
	
	Параметры = Новый Соответствие;
	
	Если Найти(ОбщийТекстОбъявлений, "[Наименование]") > 0 Тогда
		Если ЗначениеЗаполнено(Данные.Характеристика) Тогда
			Параметры.Вставить("Наименование", Строка(Данные.Наименование) + " " + Строка(Данные.Характеристика));
		Иначе
			Параметры.Вставить("Наименование", Строка(Данные.Наименование));
		КонецЕсли; 
	КонецЕсли; 
	
	Если Найти(ОбщийТекстОбъявлений, "[Артикул]") > 0 Тогда
		Параметры.Вставить("Артикул", Строка(Данные.Артикул));
	КонецЕсли; 
	
	Если Найти(ОбщийТекстОбъявлений, "[Описание]") > 0 Тогда
		Параметры.Вставить("Описание", ЗаменитьПереводСтрокиНаBR(Данные.nsDescription));
	КонецЕсли; 
	
	ИменаДопРеквизитов = ДанныеДляШаблонизатора.ИменаДопРеквизитов[Шаблон];
	Если НЕ ИменаДопРеквизитов = Неопределено Тогда
		Для каждого ИмяРеквизита Из ИменаДопРеквизитов Цикл
			Если Найти(ОбщийТекстОбъявлений, "[" + ИмяРеквизита.Значение +"]") > 0 Тогда
				ЗначениеДопРеквизита = ПолучитьЗначениеДопРеквизита(Данные.Номенклатура, ИмяРеквизита.Значение, ДанныеДляШаблонизатора.ДопРеквизиты);
				// Если совпадают реквизиты и доп реквизиты, то надо проверить, возможно уже заполнено
				ЗначениеКлюча = Параметры.Получить(ИмяРеквизита.Значение);
				Если ЗначениеКлюча = Неопределено Тогда
					Параметры.Вставить("" + ИмяРеквизита.Значение + "", ?(ЗначениеЗаполнено(ЗначениеДопРеквизита), ЗначениеДопРеквизита, ""));
				Иначе 
					// Перезаполняем значение основного реквизита только в том случае, если заполнено значение в доп реквизитах
					Если ЗначениеЗаполнено(ЗначениеДопРеквизита) Тогда
						Параметры.Вставить("" + ИмяРеквизита.Значение + "", ЗначениеДопРеквизита);	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;

	Если Найти(ОбщийТекстОбъявлений, "[ОстатокКоличество]") > 0 Тогда
		Остаток = ДанныеДляШаблонизатора.Остатки[ПолучитьID(Данные)];
		Параметры.Вставить("ОстатокКоличество", ?(ЗначениеЗаполнено(Остаток), Остаток, ""));
	КонецЕсли; 
	
	Если Найти(ОбщийТекстОбъявлений, "[ОстатокМногоМало5]") > 0 Тогда
		Если НЕ Остаток = Неопределено Тогда
			Если Остаток > 5 Тогда
				СтрОстаток = "Много";
			Иначе
				СтрОстаток = "Мало";
			КонецЕсли;
		Иначе
			СтрОстаток = Неопределено;
		КонецЕсли;
		Параметры.Вставить("ОстатокМногоМало5", ?(ЗначениеЗаполнено(СтрОстаток), СтрОстаток, ""));
	КонецЕсли; 

	Если Найти(ОбщийТекстОбъявлений, "[ОстатокМногоМало10]") > 0 Тогда
		Остаток = ДанныеДляШаблонизатора.Остатки[ПолучитьID(Данные)];
		Если НЕ Остаток = Неопределено Тогда
			Если Остаток > 10 Тогда
				СтрОстаток = "Много";
			Иначе
				СтрОстаток = "Мало";
			КонецЕсли;
		Иначе
			СтрОстаток = Неопределено;
		КонецЕсли;
		Параметры.Вставить("ОстатокМногоМало10", ?(ЗначениеЗаполнено(СтрОстаток), СтрОстаток, ""));
	КонецЕсли; 

	Если Найти(ОбщийТекстОбъявлений, "[ОстатокМногоМало20]") > 0 Тогда
		Если НЕ Остаток = Неопределено Тогда
			Если Остаток > 20 Тогда
				СтрОстаток = "Много";
			Иначе
				СтрОстаток = "Мало";
			КонецЕсли;
		Иначе
			СтрОстаток = Неопределено;
		КонецЕсли;
		Параметры.Вставить("ОстатокМногоМало20", ?(ЗначениеЗаполнено(СтрОстаток), СтрОстаток, ""));
	КонецЕсли; 

	Если Найти(ОбщийТекстОбъявлений, "[Характеристика]") > 0 Тогда
		ЗначениеХарактеристики = ПолучитьЗначениеХарактеристикиНоменклатуры(Данные.Номенклатура, ДанныеДляШаблонизатора.Характеристики);
		Параметры.Вставить("Характеристика", ЗначениеХарактеристики);
	КонецЕсли; 
	
	РеквизитыНоменклатуры = ПолучитьРеквизитыНоменклатуры();
	Для каждого Реквизит Из РеквизитыНоменклатуры Цикл
		ИмяВШаблоне = "ном_" + Реквизит.Наименование; 
		Если Найти(ОбщийТекстОбъявлений, "[" + ИмяВШаблоне + "]") > 0 Тогда
			ЗначениеРеквизита = ПолучитьЗначениеРеквизитаНоменклатуры(Данные.Номенклатура, Реквизит.Наименование, ДанныеДляШаблонизатора.РеквизитыНоменклатуры);
			Параметры.Вставить(ИмяВШаблоне, ЗначениеРеквизита);
		КонецЕсли; 
	КонецЦикла; 
	
	Для Каждого Параметр Из Параметры Цикл
		ОбщийТекстОбъявлений = СтрЗаменить(ОбщийТекстОбъявлений, "[" + Параметр.Ключ + "]", СокрЛП(Параметр.Значение));
	КонецЦикла;
	
	ОбщийТекстОбъявлений = СтрЗаменить(ОбщийТекстОбъявлений, Символы.ВК, "");
	ОбщийТекстОбъявлений = СтрЗаменить(ОбщийТекстОбъявлений, Символы.ПС, "");
	ОбщийТекстОбъявлений = СтрЗаменить(ОбщийТекстОбъявлений, "<p></p>", "");

	Возврат ОбщийТекстОбъявлений;
КонецФункции

Функция ПолучитьID(Данные)
	ID = "";
	
	Если ЗначениеЗаполнено(Данные.Характеристика) Тогда
		ID = Строка(Данные.Номенклатура.УникальныйИдентификатор()) + "#" + Строка(Данные.Характеристика.УникальныйИдентификатор());	
	Иначе
		ID = Строка(Данные.Номенклатура.УникальныйИдентификатор());	
	КонецЕсли; 
	
	Возврат ID;
КонецФункции

Функция ЗаменитьПереводСтрокиНаBR(Текст)
	Возврат СтрЗаменить(Текст, Символы.ПС, "</br>");
КонецФункции

Функция СформироватьДанныеНоменклатуры(Номенклатура)
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Объект");
	ТаблицаЗначений.Колонки.Добавить("ИмяШаблона");
	ТаблицаЗначений.Колонки.Добавить("Значение");
	
	Реквизиты = ПолучитьРеквизитыНоменклатуры();
	Если Реквизиты.Количество() = 0 Тогда
		Возврат ТаблицаЗначений;
	КонецЕсли; 
	
	Поля = "";
	Для каждого Стр Из Реквизиты Цикл
		Поля = Поля + Стр.Наименование + ",";
	КонецЦикла; 
	Поля = Лев(Поля, СтрДлина(Поля) - 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|   %1
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&Номенклатура)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", Поля);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТаблицаЗначений;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Для каждого Стр Из Реквизиты Цикл
			ИмяРеквизита = Стр.Наименование;
			ЗначениеРеквизита = Выборка[ИмяРеквизита];
			
			НовСтр = ТаблицаЗначений.Добавить();
			НовСтр.Объект = Выборка.Ссылка;
			НовСтр.ИмяШаблона = ИмяРеквизита;
			НовСтр.Значение = ЗначениеРеквизита;
		КонецЦикла; 
	КонецЦикла; 
	
	Возврат ТаблицаЗначений;
КонецФункции

Функция ПолучитьЗначениеРеквизитаНоменклатуры(Номенклатура, ИмяШаблона, Таблица) Экспорт
	
	ДанныеВозврата = Неопределено;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Объект", Номенклатура);
	Отбор.Вставить("ИмяШаблона", ИмяШаблона);
	Строки = Таблица.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		ДанныеВозврата = Строки[0].Значение;	
	КонецЕсли; 
	
	Возврат ДанныеВозврата;
КонецФункции

Функция ПолучитьЗначениеХарактеристикиНоменклатуры(Номенклатура, Таблица) Экспорт
	
	ДанныеВозврата = Неопределено;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	Строки = Таблица.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		ДанныеВозврата = Строки[0].ЗначениеДляШаблона;	
	КонецЕсли; 
	
	Возврат ДанныеВозврата;
КонецФункции
